{
  "version": "0.6",
  "pageContent": 
  {
    "_comments": "JSON object that contains data for page labels, buttons, etc.",
    "navItems": 
    {
      "_common": 
      {
        "buttonBackToGallery": 
        {
          "name": "Back To Gallery",
          "method": "backToGallery()",
          "idName": "backToGallery"  
        },
        "buttonStartTutorial": 
        {
          "name": "Start Tutorial",
          "method": "startTutorialFromDetailsScreen()",
          "idName": "startTutorial"
        },
        "buttonViewDetails": 
        {
          "name": "View Details",
          "method": "viewDetails()",
          "idName": "stepsViewDetails"  
        }
      }
    }
  },
  "tutorial": 
  {
    "_common": 
    {
      "name": "IBM Cloud Product Insights Registration and Monitoring",
      "shortDescription": "Learn how to register and monitor IBM Integration Bus usages with IBM Cloud Product Insights service.",
      "durationText": "This tutorial takes approximately",
      "durationTime": "10 minutes",
      "_resourceToOpenComment": "The ID of the first resource to open when the user imports the tutorial. Resource IDs are defined in the repo_metadata.json Tutorials listing on ot4i.",
      "resourceToOpen": "MainFlow",
      "helpLink": 
      {
        "text": "IBM Knowledge Center",
        "link": "/com.ibm.etools.msgbroker.helphome.doc/help_home_msgbroker.htm"
      }
    },
    "pageDetails": 
    {
      "topicsName": "Tutorial Topics",
      "_topicListComment": "A short list of product concepts or tasks demonstrated by this tutorial",
      "topicList": 
      [
        {
          "title": "Register with Product Insights"
        }
      ],
      "outcomesName": "Learning outcomes",
      "_outcomesComment": "A description of what the user will have learned or accomplished by running this tutorial.",
      "outcomeList": 
      [
        {
          "title": "Registration and monitoring of IBM Integration Bus with Product Insights service."
        }
      ],
      "summary": 
      {
        "overviewName": "OVERVIEW",
        "_overviewComment": "A short description of what happens in this tutorial, and an optional short explanation of the IIB concepts used in this tutorial if necessary for context. What background knowledge must the user have for this to make sense?",
        "sections": 
        [
          {
            "section": "This tutorial demonstrates how to register IBM Integration Bus to the Product Insights service and using it to monitor its usage."
          },
          {
            "section": "The Product Insights service gathers product information and usage data from IBM Integration Bus and displays it in the Product Insights dashboard. By accessing these data you can gain a greater insight into the workload of the product."
          }
        ]
      },
      "helpLinks": 
      {
        "_helpLinksComment": "Helplinks that have a type:web attribute are rendered as web links. Otherwise, links are assumed to be to embedded Help topics in the Knowledge Center.",
        "title": "Find out more",
        "details": 
        [
          {
            "title": "Knowledge Center link to ",
            "description": "Developing integration solutions by using applications",
            "link": "com.ibm.etools.mft.doc/bi12002_.htm",
            "type": "help"
          },
          {
            "title": "GitHub link to ",
            "description": "DFDL Schemas",
            "link": "http://github.com/DFDLSchemas",
            "type": "web"
          }
        ]
      }
    },
    "pageSteps": 
    {
      "create": 
      {
        "overview": 
        {
          "name": "Create",
          "heading": "Import projects",
          "_createComment": "A description of what will happen when the user clicks Import.",
          "sections": 
          [
            {
              "section": "When you click Import, the <b>PrimeNumbers</b> application will be created in you workspace."
            },
            {
              "section": "<b>PrimNumbers</b> uses the Compute node to look for all the prime numbers between 0 and 100000. This will be use as a way to create some data for the Product Insights service dashboard to show."
            }
          ]
        },
        "actions": 
        {
          "title": "Create Actions",
          "details": 
          [
            {
              "name": "Import",
              "method": "importArtifacts()"
            }
          ]
        }
      },
      "prepare": 
      {
        "overview": 
        {
          "name": "Prepare",
          "heading": "Getting an API host and API key",
          "_prepareComment": "A description of what just happened when the user clicked Import, and what will happen when the user clicks Deploy.",
          "sections": 
          [
            {
              "section": "Before you can register your integration server with the Product Insights service you will need to have an API host and API key for you Product Insights service."
            },
            {
              "section": "If you already have one then you can move on to the <b>Run</b> section."
            },
            {
              "section": "You can follow the instruction in <b>Configuring the IBM Cloud Product Insights service</b> of the IBM Knowledge Center to get the API host and API key."
            }
          ]
        }
      },
      "run": 
      {
        "overview": 
        {
          "name": "Run",
          "heading": "Follow these steps to complete the tutorial",
          "_runComment": "The full steps for the user to run through the tutorial. Use 'sections' to render paragraphs, 'steps' with a type of 'ordered' or 'unordered' to render HTML lists, and 'substeps' to render nested lists.",
          "sections": 
          [
            {
              "section": "Follow the instruction to register IBM Integration Bus with Product Insights service.",
              "steps": 
              {
                "type": "ordered",
                "details": 
                [
                  {
                    "details": "Open an IBM Integration Console and use the command mqsichangebluemixreporting to register you integration server. Instruction can be find in <b>Configuring an integration server to send startup and usage information to IBM Cloud Product Insights</b> of the IBM Knowledge Center."
                  },
                  {
                    "details": "After registration, goto your web browser to logon to your IBM Bluemix account to open the Integrate services dashboard and select the Integrate Service you just created."
                  },
                  {
                    "details": "In the dashboard, select the IBM Integration Bus."
                  },
                  {
                    "details": "If you registered in a group then your integration node with be a member of that group, expand the group."
                  },
                  {
                    "details": "Select your integration node in the left column and in the center column select your integration server. The right-hand column will show the usage data for the selected integration server."
                  },
                  {
                    "details": "On the right-hand column, if <b>Usage</b> is not selected, select it."
                  },
                  {
                    "details": "Under <b>Usage</b> the chart can select to show one of three measurements. <b>CPU time</b> shows the CPU usage time by the selected server (in milli-seconds). <b>Number of active CPUs</b> shows the number of active CPUs available for use. <b> Resident set size</b> shows the maximum recorded memory usage."
                  },
                  {
                    "details": "Goto your IBM Integration Toolkit and open the <b>PrimeNumbers.msgflow</b> and run it in the Flow Exerciser with an empty message."
                  },
                  {
                    "details": "Goto your web browser and refresh the dashboard to see the usage data. Depending on the options used in the registation step, it might take a few minutes for the data to be update."
                  }
                ]
              }
            },
            {
              "section": "This tutorial has shown how to register and monitor the usage of IBM Integration Bus with Hybrid Connect service."
            }
          ]
        },
        "helpLinks": 
        {
          "title": "Find out more",
          "details": 
          [
            {
              "title": "Knowledge Center link to ",
              "description": "Testing your message flow by using the Flow exerciser",
              "link": "com.ibm.etools.mft.doc/rt26110_.htm"
            }
          ]
        },
        "actions": 
        {
          "title": "Run Actions",
          "details": 
          [
            {
              "name": "Deploy",
              "method": "deployArtifacts()"
            }
          ]
        },
        "exits": 
        {
          "title": "Run Exits",
          "details": 
          [
            {
              "name": "Clean Up",
              "description": "Clean up and remove any changes in your workspace made by the tutorial.",
              "method": "cleanUp()"
            }
          ]
        }
      }
    }
  }
}